mdhardenburgh/Blinky/Packages/.cache/NXP.LPC54102_DFP.12.0.0.pdsc
        __ap = 1;                                       // Access via masterCPU access port
        Write32( CPBOOT, slaveBOOT);                    // Set slave boot address
        Write32( CPSTACK, slaveSTACK);                  // Set slave stack address

        resetCPU = value | 0x00000010;
        Write32( CPUCTRL, resetCPU);                    // Reset Cortex-M0 via CPUCTRL, CM0RSTEN(Bit5)
        Write32( CPUCTRL, value);                       // Release Cortex-M0 from reset
        __ap = 0;
      </block>
          </control>
        </sequence>
        <sequence name="ResetProcessor_LPC5410x_M0">
          <block>
      __var value      = 0;
      __var masterCPU  = 0;
      __var resetCPU   = 0;
      __var CPUCTRL    = 0x40000300;
      __var CPBOOT     = 0x40000304;
      __var CPSTACK    = 0x40000308;
      __var slaveBOOT  = 0;
      __var slaveSTACK = 0;

      // Get MasterCPU
      value = Read32( CPUCTRL);                         //  CPU Control register: CPUCTRL (0x40000800)
      value = 0xC0C40000 | (value &amp; 0x0000FFFF);    //  Bit31:16 must be written as 0xC0C4 for the write to have an effect
      value = value &amp; 0xFFFF807D;                   //  Bit1, Bit7:14 should be 0
      masterCPU = value &amp; 0x00000001;
    </block>
          <control if="masterCPU == 1" info="Cortex-M0 is the slave CPU">
            <block>
        slaveBOOT = Read32( sCPU_ImageEntry + 4);
        slaveSTACK = Read32( sCPU_ImageEntry);

        __ap = 0;                                       // Access via masterCPU access port
        Write32( CPBOOT, slaveBOOT);                    // Set slave boot address
        Write32( CPSTACK, slaveSTACK);                  // Set slave stack address

        resetCPU = value | 0x00000020;
        Write32( CPUCTRL, resetCPU);                    // Reset Cortex-M0 via CPUCTRL, CM0RSTEN(Bit5)
        Write32( CPUCTRL, value);                       // Release Cortex-M0 from reset
        __ap = 1;
      </block>
          </control>
          <control if="masterCPU == 0" info="Cortex-M0 is the master CPU">
            <block>
        //Write32(0xE000ED0C, 0x05FA0001);              // Reset Cortex-M0, execute VECTRESET via AIRCR, !!! THERE IS NO VECTRESET IN AIRCR
                                                        // DOES NOT SUPPORTED
      </block>
          </control>
        </sequence>
      </sequences>
      <debugvars configfile="arm/LPC541xx.dbgconf">
  // Debug Access Variables, can be modified by user via copies of DBGCONF files as created by uVision. Also see sub-family level.
  __var LPC541xx_SWO_Pin      = 0;                    // Serial Wire Output pin: 0 = PIO0_15, 1 = PIO1_1
  __var Dbg_CR                = 0x00000000;           // DBG_CR
  __var sCPU_ImageEntry       = 0x00020000;           // Slave CPU Image Start Entry
</debugvars>
      <description>The LPC5410x are ARM Cortex-M4 based microcontrollers for embedded applications. These devices include an ARM Cortex-M0+ coprocessor, up to 104 KB of on-chip SRAM, up to 512 KB on-chip flash, five general-purpose timers, one SCTimer/PWM, one RTC/alarm timer, one 24-bit Multi-Rate Timer (MRT), a Windowed Watchdog Timer (WWDT), 3 USART, 2 SPI, and 3 I2C interface, and one 12-bit 5.0 Msamples/sec ADC. The ARM Cortex-M4 is a 32-bit core that offers system enhancements such as low power consumption, enhanced debug features, and a high level of support block integration. The ARM Cortex-M4 CPU incorporates a 3-stage pipeline, uses a Harvard architecture with separate local instruction and data buses as well as a third bus for peripherals, and includes an internal prefetch unit that supports speculative branching. The ARM Cortex-M4 supports single-cycle digital signal processing and SIMD instructions. A hardware floating-point unit is integrated in the core. The ARM Cortex-M0+ coprocessor is an energy-efficient and easy-to-use 32-bit core which is code and tool-compatible with the Cortex-M4 core. The Cortex-M0+ coprocessor offers up to 100 MHz performance with a simple instruction set and reduced code size.</description>
      <device Dname="LPC54102J512">
        <processor Pname="cm0plus" Dcore="Cortex-M0+" Dfpu="NO_FPU" Dmpu="NO_MPU" Dendian="Little-endian" Dclock="100000000"/>
        <processor Pname="cm4" Dcore="Cortex-M4" Dfpu="SP_FPU" Dmpu="MPU" Dendian="Little-endian" Dclock="100000000"/>
        <environment Pname="cm0plus" name="iar">
          <file category="linkerfile" name="iar/LPC54102J512_cm0plus.icf"/>
        </environment>
        <environment Pname="cm4" name="iar">
          <file category="linkerfile" name="iar/LPC54102J512_cm4.icf"/>
        </environment>
        <sequences>
          <sequence name="ResetProcessor" Pname="cm4">
            <block>
      Sequence("ResetProcessor_LPC5410x_M4");
    </block>
          </sequence>
          <sequence name="ResetProcessor" Pname="cm0plus">
            <block>
      Sequence("ResetProcessor_LPC5410x_M0");
    </block>
          </sequence>
          <sequence name="ResetCatchSet" Pname="cm4">
            <block>
      Sequence("ResetCatchSet_LPC5410x_M4");
    </block>
          </sequence>
          <sequence name="ResetCatchSet" Pname="cm0plus">
            <block>
      Sequence("ResetCatchSet_LPC5410x_M0");
    </block>
          </sequence>
          <sequence name="TraceStart" Pname="cm4">
            <block>
      Sequence("TraceStart_CM4");
    </block>
          </sequence>
          <sequence name="TraceStart" Pname="cm0plus">
            <block>

    </block>
          </sequence>
        </sequences>
        <memory name="PROGRAM_FLASH" start="0x00000000" size="0x080000" access="rx" default="1" startup="1"/>
        <memory name="SRAM0" start="0x02000000" size="0x010000" access="rw" default="1"/>
        <memory name="SRAM1" start="0x02010000" size="0x8000" access="rw" default="1"/>
        <memory name="SRAM2" start="0x03400000" size="0x2000" access="rw" default="1"/>
        <algorithm Pname="cm4" name="arm/LPC5410x_512.FLM" start="0x00000000" size="0x00080000" RAMstart="0x02000000" RAMsize="0x00001000" default="1"/>
        <debug svd="LPC54102_cm0plus.xml" Pname="cm0plus" __dp="0" __ap="1"/>
        <debug svd="LPC54102_cm4.xml" Pname="cm4" __dp="0" __ap="0"/>
        <variant Dvariant="LPC54102J512BD64">
          <compile Pname="cm0plus" header="fsl_device_registers.h" define="CPU_LPC54102J512BD64_cm0plus"/>
          <compile Pname="cm4" header="fsl_device_registers.h" define="CPU_LPC54102J512BD64_cm4"/>
          <environment Pname="cm0plus" name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/LPC54102J512BD64_cm0p/LPC54102J512_cm0plus.scf"</LMisc>
          </environment>
          <environment Pname="cm4" name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/LPC54102J512BD64_cm4/LPC54102J512_cm4.scf"</LMisc>
          </environment>
        </variant>
        <variant Dvariant="LPC54102J512UK49">
          <compile Pname="cm0plus" header="fsl_device_registers.h" define="CPU_LPC54102J512UK49_cm0plus"/>
          <compile Pname="cm4" header="fsl_device_registers.h" define="CPU_LPC54102J512UK49_cm4"/>
          <environment Pname="cm0plus" name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/LPC54102J512UK49_cm0p/LPC54102J512_cm0plus.scf"</LMisc>
          </environment>
          <environment Pname="cm4" name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/LPC54102J512UK49_cm4/LPC54102J512_cm4.scf"</LMisc>
          </environment>
        </variant>
      </device>
