mdhardenburgh/Blinky/Packages/.cache/NXP.LPC54102_DFP.12.0.0.pdsc
    <condition id="device.LPC54102_AND_driver.vusart">
      <accept Dname="LPC54102J512*" Dvendor="NXP:11"/>
      <accept Dname="LPC54102J256*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="usart"/>
    </condition>
    <condition id="device.LPC54102_AND_driver.common_AND_driver.vusart">
      <accept Dname="LPC54102J512*" Dvendor="NXP:11"/>
      <accept Dname="LPC54102J256*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="usart"/>
    </condition>
    <condition id="CMSIS_Include_core_cm0plus">
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="CMSIS_Include_core_cm4">
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="_CMSIS_Include_core_cm0plus__OR__CMSIS_Include_core_cm4_">
      <accept condition="CMSIS_Include_core_cm0plus"/>
      <accept condition="CMSIS_Include_core_cm4"/>
    </condition>
    <condition id="device.LPC54102_AND__CMSIS_Include_core_cm0plus__OR__CMSIS_Include_core_cm4_">
      <accept Dname="LPC54102J512*" Dvendor="NXP:11"/>
      <accept Dname="LPC54102J256*" Dvendor="NXP:11"/>
      <require condition="_CMSIS_Include_core_cm0plus__OR__CMSIS_Include_core_cm4_"/>
    </condition>
    <condition id="core_type.cm0p_AND_mdk">
      <require Tcompiler="ARMCC"/>
      <require Dcore="Cortex-M0+"/>
    </condition>
    <condition id="core_type.cm4f_AND_mdk">
      <require Tcompiler="ARMCC"/>
      <require Dcore="Cortex-M4"/>
    </condition>
    <condition id="core_type.cm0p_AND_iar">
      <require Tcompiler="IAR"/>
      <require Dcore="Cortex-M0+"/>
    </condition>
    <condition id="core_type.cm4f_AND_iar">
      <require Tcompiler="IAR"/>
      <require Dcore="Cortex-M4"/>
    </condition>
    <condition id="core_type.cm0p">
      <require Dcore="Cortex-M0+"/>
    </condition>
    <condition id="core_type.cm4f">
      <require Dcore="Cortex-M4"/>
    </condition>
    <condition id="device.LPC54102_AND_driver.common_AND_driver.power">
      <accept Dname="LPC54102J512*" Dvendor="NXP:11"/>
      <accept Dname="LPC54102J256*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="power"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
    </condition>
    <condition id="device.LPC54102_AND_CMSIS_Driver_Include.I2C_AND_RTE_Device_AND_driver.lpc_i2c_dma">
      <accept Dname="LPC54102J512*" Dvendor="NXP:11"/>
      <accept Dname="LPC54102J256*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c_dma"/>
      <require Cclass="CMSIS Driver" Cgroup="I2C" Capiversion="2.3.0"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
    </condition>
    <condition id="device.LPC54102_AND_CMSIS_Driver_Include.SPI_AND_RTE_Device_AND_driver.vspi_AND_driver.vspi_dma">
      <accept Dname="LPC54102J512*" Dvendor="NXP:11"/>
      <accept Dname="LPC54102J256*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="spi"/>
      <require Cclass="CMSIS Driver" Cgroup="SPI" Capiversion="2.2.0"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="spi_dma"/>
    </condition>
    <condition id="device.LPC54102_AND_CMSIS_Driver_Include.USART_AND_RTE_Device_AND_driver.vusart_AND_driver.vusart_dma">
      <accept Dname="LPC54102J512*" Dvendor="NXP:11"/>
      <accept Dname="LPC54102J256*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="usart"/>
      <require Cclass="CMSIS Driver" Cgroup="USART" Capiversion="2.3.0"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="usart_dma"/>
    </condition>
    <condition id="device.LPC54102_AND_device.LPC54102_CMSIS_AND_driver.clock_AND_driver.reset">
      <accept Dname="LPC54102J512*" Dvendor="NXP:11"/>
      <accept Dname="LPC54102J256*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="clock"/>
      <require Cclass="Device" Cgroup="Startup"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="reset"/>
    </condition>
    <condition id="device.LPC54102_AND_CMSIS_Driver_Include.I2C">
      <accept Dname="LPC54102J512*" Dvendor="NXP:11"/>
      <accept Dname="LPC54102J256*" Dvendor="NXP:11"/>
      <require Cclass="CMSIS Driver" Cgroup="I2C" Capiversion="2.3.0"/>
    </condition>
    <condition id="device.LPC54102_AND_driver.common_AND_driver.inputmux_connections">
      <accept Dname="LPC54102J512*" Dvendor="NXP:11"/>
      <accept Dname="LPC54102J256*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="inputmux_connections"/>
    </condition>
    <condition id="device.LPC54102_AND_driver.lpc_dma_AND_driver.lpc_i2c">
      <accept Dname="LPC54102J512*" Dvendor="NXP:11"/>
      <accept Dname="LPC54102J256*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dma"/>
    </condition>
    <condition id="device.LPC54102_AND_driver.lpc_dma_AND_driver.vspi">
      <accept Dname="LPC54102J512*" Dvendor="NXP:11"/>
      <accept Dname="LPC54102J256*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="spi"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dma"/>
    </condition>
    <condition id="device.LPC54102_AND_driver.lpc_dma_AND_driver.vusart">
      <accept Dname="LPC54102J512*" Dvendor="NXP:11"/>
      <accept Dname="LPC54102J256*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="usart"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dma"/>
    </condition>
    <condition id="device.LPC54102_AND_utility.debug_console">
      <accept Dname="LPC54102J512*" Dvendor="NXP:11"/>
      <accept Dname="LPC54102J256*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console"/>
    </condition>
    <condition id="device.LPC54102_AND_component.serial_manager_AND_driver.common">
      <accept Dname="LPC54102J512*" Dvendor="NXP:11"/>
      <accept Dname="LPC54102J256*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
    </condition>
    <condition id="device.LPC54102_AND_component.lists_AND_driver.common_AND_utility.debug_console">
      <accept Dname="LPC54102J512*" Dvendor="NXP:11"/>
      <accept Dname="LPC54102J256*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lists"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
    </condition>
