mdhardenburgh/Blinky/Packages/.cache/NXP.LPC54102_DFP.12.0.0.pdsc
  </conditions>
  <components>
    <component Cclass="Board Support" Cgroup="SDK Project Template" Csub="project_template" Cvariant="LPC54102" Cversion="1.0.0" condition="device.LPC54102_AND_component.serial_manager_uart_AND_component.vusart_adapter_AND_device.LPC54102_startup_AND_driver.clock_AND_driver.common_AND_driver.lpc_gpio_AND_driver.lpc_iocon_AND_driver.power_AND_driver.vusart_AND_utility.debug_console" isDefaultVariant="1">
      <description/>
      <files>
        <file category="sourceC" attr="config" name="project_template/board.c"/>
        <file category="header" attr="config" name="project_template/board.h"/>
        <file category="sourceC" attr="config" name="project_template/clock_config.c"/>
        <file category="header" attr="config" name="project_template/clock_config.h"/>
        <file category="sourceC" attr="config" name="project_template/peripherals.c"/>
        <file category="header" attr="config" name="project_template/peripherals.h"/>
        <file category="sourceC" attr="config" name="project_template/pin_mux.c"/>
        <file category="header" attr="config" name="project_template/pin_mux.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device" Cversion="1.0.0" condition="device.LPC54102_AND_driver.lpc_dma">
      <description/>
      <files>
        <file category="header" attr="config" name="template/RTE_Device.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="ctimer_adapter" Cversion="1.0.0" condition="device.LPC54102_AND_driver.common_AND_driver.ctimer">
      <description/>
      <files>
        <file category="sourceC" name="components/timer/ctimer_adapter.c"/>
        <file category="header" name="components/timer/timer.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="lists" Cversion="1.0.0" condition="device.LPC54102_AND_driver.common">
      <description/>
      <files>
        <file category="sourceC" name="components/lists/generic_list.c"/>
        <file category="header" name="components/lists/generic_list.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager" Cversion="1.0.0" condition="device.LPC54102_AND_component.lists_AND_driver.common">
      <description/>
      <files>
        <file category="sourceC" name="components/serial_manager/serial_manager.c"/>
        <file category="header" name="components/serial_manager/serial_manager.h"/>
        <file category="header" name="components/serial_manager/serial_port_internal.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_uart" Cversion="1.0.0" condition="device.LPC54102_AND_driver.vusart">
      <description/>
      <files>
        <file category="sourceC" name="components/serial_manager/serial_port_uart.c"/>
        <file category="header" name="components/serial_manager/serial_port_uart.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="vusart_adapter" Cversion="1.0.0" condition="device.LPC54102_AND_driver.common_AND_driver.vusart">
      <description/>
      <files>
        <file category="header" name="components/uart/uart.h"/>
        <file category="sourceC" name="components/uart/vusart_adapter.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="device.LPC54102_AND__CMSIS_Include_core_cm0plus__OR__CMSIS_Include_core_cm4_">
      <description/>
      <files>
        <file condition="core_type.cm0p_AND_mdk" category="sourceAsm" attr="config" name="arm/startup_LPC54102_cm0plus.s"/>
        <file condition="core_type.cm4f_AND_mdk" category="sourceAsm" attr="config" name="arm/startup_LPC54102_cm4.s"/>
        <file condition="core_type.cm0p_AND_iar" category="sourceAsm" attr="config" name="iar/startup_LPC54102_cm0plus.s"/>
        <file condition="core_type.cm4f_AND_iar" category="sourceAsm" attr="config" name="iar/startup_LPC54102_cm4.s"/>
        <file condition="core_type.cm0p_AND_mdk" category="linkerScript" attr="config" name="arm/LPC54102J256_cm0plus.scf"/>
        <file condition="core_type.cm0p_AND_mdk" category="linkerScript" attr="config" name="arm/LPC54102J256_cm0plus_ram.scf"/>
        <file condition="core_type.cm4f_AND_mdk" category="linkerScript" attr="config" name="arm/LPC54102J256_cm4.scf"/>
        <file condition="core_type.cm4f_AND_mdk" category="linkerScript" attr="config" name="arm/LPC54102J256_cm4_ram.scf"/>
        <file condition="core_type.cm0p_AND_mdk" category="linkerScript" attr="config" name="arm/LPC54102J512_cm0plus.scf"/>
        <file condition="core_type.cm0p_AND_mdk" category="linkerScript" attr="config" name="arm/LPC54102J512_cm0plus_ram.scf"/>
        <file condition="core_type.cm4f_AND_mdk" category="linkerScript" attr="config" name="arm/LPC54102J512_cm4.scf"/>
        <file condition="core_type.cm4f_AND_mdk" category="linkerScript" attr="config" name="arm/LPC54102J512_cm4_ram.scf"/>
        <file condition="core_type.cm0p_AND_iar" category="linkerScript" attr="config" name="iar/LPC54102J256_cm0plus.icf"/>
        <file condition="core_type.cm0p_AND_iar" category="linkerScript" attr="config" name="iar/LPC54102J256_cm0plus_ram.icf"/>
        <file condition="core_type.cm4f_AND_iar" category="linkerScript" attr="config" name="iar/LPC54102J256_cm4.icf"/>
        <file condition="core_type.cm4f_AND_iar" category="linkerScript" attr="config" name="iar/LPC54102J256_cm4_ram.icf"/>
        <file condition="core_type.cm0p_AND_iar" category="linkerScript" attr="config" name="iar/LPC54102J512_cm0plus.icf"/>
        <file condition="core_type.cm0p_AND_iar" category="linkerScript" attr="config" name="iar/LPC54102J512_cm0plus_ram.icf"/>
        <file condition="core_type.cm4f_AND_iar" category="linkerScript" attr="config" name="iar/LPC54102J512_cm4.icf"/>
        <file condition="core_type.cm4f_AND_iar" category="linkerScript" attr="config" name="iar/LPC54102J512_cm4_ram.icf"/>
        <file condition="core_type.cm0p" category="header" attr="config" name="LPC54102_cm0plus.h"/>
        <file condition="core_type.cm0p" category="header" attr="config" name="LPC54102_cm0plus_features.h"/>
        <file condition="core_type.cm4f" category="header" attr="config" name="LPC54102_cm4.h"/>
        <file condition="core_type.cm4f" category="header" attr="config" name="LPC54102_cm4_features.h"/>
        <file category="header" attr="config" name="fsl_device_registers.h"/>
        <file condition="core_type.cm0p" category="sourceC" attr="config" name="system_LPC54102_cm0plus.c"/>
        <file condition="core_type.cm0p" category="header" attr="config" name="system_LPC54102_cm0plus.h"/>
        <file condition="core_type.cm4f" category="sourceC" attr="config" name="system_LPC54102_cm4.c"/>
        <file condition="core_type.cm4f" category="header" attr="config" name="system_LPC54102_cm4.h"/>
      </files>
    </component>
